app/views/articles/show.html.erb


        <% @article = Article.find(params[:id]) do %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]