app/controllers/articles_controller.rb

  def index
    if params[:category].blank?
      @articles = Article.all.order('created_at DESC')
    else
      @category_id = Category.find_by(name: params[:category]).id
      @articles = Article.where(category_id: @category_id).order('created_at DESC')
---
SELECT 1 AS one FROM "categories" LIMIT $1  [["LIMIT", 1]]
SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" ORDER BY created_at DESC
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Lifestyle"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY created_at DESC  [["category_id", 1]]

  def new
    @article = current_user.articles.build
    @categories = Category.all.map { |c| [c.name, c.id] }
---
SELECT "categories".* FROM "categories"

  def create
    @article = current_user.articles.build(article_params)
    @article.category_id = params[:category_id]
    @categories = Category.all.map { |c| [c.name, c.id] }

    if @article.save
---
SELECT "categories".* FROM "categories"
INSERT INTO "articles" ("title", "description", "author", "created_at", "updated_at", "user_id", "category_id", "article_img_file_name", "article_img_content_type", "article_img_file_size", "article_img_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

  def update
    @article.category_id = params[:category_id]
    if @article.update(article_params)
---
UPDATE "articles" SET "title" = $1, "description" = $2, "author" = $3, "updated_at" = $4, "category_id" = $5, "article_img_file_name" = $6, "article_img_file_size" = $7, "article_img_updated_at" = $8 WHERE "articles"."id" = $9

  def upvote
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def downvote
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def find_most_voted_article
    with_voted = Article.all
    @most_voted = with_voted.sort_by(&:cached_votes_up).reverse.first
---
SELECT "articles".* FROM "articles"