app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_category
    @category = Category.find(params[:id])