app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @review.article_id = @article.id
    @review.user_id = current_user.id

    if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "article_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "ABC"], ["created_at", "2021-04-30 17:45:30.996855"], ["updated_at", "2021-04-30 17:45:30.996855"], ["user_id", 1], ["article_id", 8]]

  def update
    if @review.update(review_params)
---
UPDATE "reviews" SET "rating" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 10], ["comment", "AAAA"], ["updated_at", "2021-04-30 18:38:52.018944"], ["id", 3]]

  def find_article
    @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]